# AddBarGeometry Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarTrimExtendData..::..AddBarGeometry Method
RebarTrimExtendData Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddBarGeometry(IList<(Of <<'(Curve>)>>)) | Adds a new rebar geometry. This information is set to the rebar after the API execution is finished successfully. |
| AddBarGeometry(CurveLoop) | Adds a new rebar geometry. This information is set to the rebar after the API execution is finished successfully. |

# See Also
RebarTrimExtendData Class
RebarTrimExtendData Members
Autodesk.Revit.DB.Structure Namespace